MikroElektronika/core_packages/PIC/XC8/def/PIC18F242/mcu.h
extern volatile INTCONbits_t INTCONbits __at(0xFF2);
// bitfield macros
#define _INTCON_RBIF_POSN                                   0x0
#define _INTCON_RBIF_POSITION                               0x0
#define _INTCON_RBIF_SIZE                                   0x1
#define _INTCON_RBIF_LENGTH                                 0x1
#define _INTCON_RBIF_MASK                                   0x1
#define _INTCON_INT0IF_POSN                                 0x1
#define _INTCON_INT0IF_POSITION                             0x1
#define _INTCON_INT0IF_SIZE                                 0x1
#define _INTCON_INT0IF_LENGTH                               0x1
#define _INTCON_INT0IF_MASK                                 0x2
#define _INTCON_TMR0IF_POSN                                 0x2
#define _INTCON_TMR0IF_POSITION                             0x2
#define _INTCON_TMR0IF_SIZE                                 0x1
#define _INTCON_TMR0IF_LENGTH                               0x1
#define _INTCON_TMR0IF_MASK                                 0x4
#define _INTCON_RBIE_POSN                                   0x3
#define _INTCON_RBIE_POSITION                               0x3
#define _INTCON_RBIE_SIZE                                   0x1
#define _INTCON_RBIE_LENGTH                                 0x1
#define _INTCON_RBIE_MASK                                   0x8
#define _INTCON_INT0IE_POSN                                 0x4
#define _INTCON_INT0IE_POSITION                             0x4
#define _INTCON_INT0IE_SIZE                                 0x1
#define _INTCON_INT0IE_LENGTH                               0x1
#define _INTCON_INT0IE_MASK                                 0x10
#define _INTCON_TMR0IE_POSN                                 0x5
#define _INTCON_TMR0IE_POSITION                             0x5
#define _INTCON_TMR0IE_SIZE                                 0x1
#define _INTCON_TMR0IE_LENGTH                               0x1
#define _INTCON_TMR0IE_MASK                                 0x20
#define _INTCON_PEIE_GIEL_POSN                              0x6
#define _INTCON_PEIE_GIEL_POSITION                          0x6
#define _INTCON_PEIE_GIEL_SIZE                              0x1
#define _INTCON_PEIE_GIEL_LENGTH                            0x1
#define _INTCON_PEIE_GIEL_MASK                              0x40
#define _INTCON_GIE_GIEH_POSN                               0x7
#define _INTCON_GIE_GIEH_POSITION                           0x7
#define _INTCON_GIE_GIEH_SIZE                               0x1
#define _INTCON_GIE_GIEH_LENGTH                             0x1
#define _INTCON_GIE_GIEH_MASK                               0x80
#define _INTCON_INT0F_POSN                                  0x1
#define _INTCON_INT0F_POSITION                              0x1
#define _INTCON_INT0F_SIZE                                  0x1
#define _INTCON_INT0F_LENGTH                                0x1
#define _INTCON_INT0F_MASK                                  0x2
#define _INTCON_T0IF_POSN                                   0x2
#define _INTCON_T0IF_POSITION                               0x2
#define _INTCON_T0IF_SIZE                                   0x1
#define _INTCON_T0IF_LENGTH                                 0x1
#define _INTCON_T0IF_MASK                                   0x4
#define _INTCON_INT0E_POSN                                  0x4
#define _INTCON_INT0E_POSITION                              0x4
#define _INTCON_INT0E_SIZE                                  0x1
#define _INTCON_INT0E_LENGTH                                0x1
#define _INTCON_INT0E_MASK                                  0x10
#define _INTCON_T0IE_POSN                                   0x5
#define _INTCON_T0IE_POSITION                               0x5
#define _INTCON_T0IE_SIZE                                   0x1
#define _INTCON_T0IE_LENGTH                                 0x1
#define _INTCON_T0IE_MASK                                   0x20
#define _INTCON_PEIE_POSN                                   0x6
#define _INTCON_PEIE_POSITION                               0x6
#define _INTCON_PEIE_SIZE                                   0x1
#define _INTCON_PEIE_LENGTH                                 0x1
#define _INTCON_PEIE_MASK                                   0x40
#define _INTCON_GIE_POSN                                    0x7
#define _INTCON_GIE_POSITION                                0x7
#define _INTCON_GIE_SIZE                                    0x1
#define _INTCON_GIE_LENGTH                                  0x1
#define _INTCON_GIE_MASK                                    0x80
#define _INTCON_GIEL_POSN                                   0x6
#define _INTCON_GIEL_POSITION                               0x6
#define _INTCON_GIEL_SIZE                                   0x1
#define _INTCON_GIEL_LENGTH                                 0x1
#define _INTCON_GIEL_MASK                                   0x40
#define _INTCON_GIEH_POSN                                   0x7
#define _INTCON_GIEH_POSITION                               0x7
#define _INTCON_GIEH_SIZE                                   0x1
#define _INTCON_GIEH_LENGTH                                 0x1
#define _INTCON_GIEH_MASK                                   0x80
// alias bitfield definitions
typedef union {
    struct {
        unsigned RBIF                   :1;
        unsigned INT0IF                 :1;
        unsigned TMR0IF                 :1;
        unsigned RBIE                   :1;
        unsigned INT0IE                 :1;
        unsigned TMR0IE                 :1;
        unsigned PEIE_GIEL              :1;
        unsigned GIE_GIEH               :1;
    };
    struct {
        unsigned                        :1;
        unsigned INT0F                  :1;
        unsigned T0IF                   :1;
        unsigned                        :1;
        unsigned INT0E                  :1;
        unsigned T0IE                   :1;
        unsigned PEIE                   :1;
        unsigned GIE                    :1;
    };
    struct {
        unsigned                        :6;
        unsigned GIEL                   :1;
        unsigned GIEH                   :1;
    };
} INTCON1bits_t;
extern volatile INTCON1bits_t INTCON1bits __at(0xFF2);
// bitfield macros
#define _INTCON1_RBIF_POSN                                  0x0
#define _INTCON1_RBIF_POSITION                              0x0
#define _INTCON1_RBIF_SIZE                                  0x1
#define _INTCON1_RBIF_LENGTH                                0x1
#define _INTCON1_RBIF_MASK                                  0x1
#define _INTCON1_INT0IF_POSN                                0x1
#define _INTCON1_INT0IF_POSITION                            0x1
#define _INTCON1_INT0IF_SIZE                                0x1
#define _INTCON1_INT0IF_LENGTH                              0x1
#define _INTCON1_INT0IF_MASK                                0x2
#define _INTCON1_TMR0IF_POSN                                0x2
#define _INTCON1_TMR0IF_POSITION                            0x2
#define _INTCON1_TMR0IF_SIZE                                0x1
#define _INTCON1_TMR0IF_LENGTH                              0x1
#define _INTCON1_TMR0IF_MASK                                0x4
#define _INTCON1_RBIE_POSN                                  0x3
#define _INTCON1_RBIE_POSITION                              0x3
#define _INTCON1_RBIE_SIZE                                  0x1
#define _INTCON1_RBIE_LENGTH                                0x1
#define _INTCON1_RBIE_MASK                                  0x8
#define _INTCON1_INT0IE_POSN                                0x4
#define _INTCON1_INT0IE_POSITION                            0x4
#define _INTCON1_INT0IE_SIZE                                0x1
#define _INTCON1_INT0IE_LENGTH                              0x1
#define _INTCON1_INT0IE_MASK                                0x10
#define _INTCON1_TMR0IE_POSN                                0x5
#define _INTCON1_TMR0IE_POSITION                            0x5
#define _INTCON1_TMR0IE_SIZE                                0x1
#define _INTCON1_TMR0IE_LENGTH                              0x1
#define _INTCON1_TMR0IE_MASK                                0x20
#define _INTCON1_PEIE_GIEL_POSN                             0x6
#define _INTCON1_PEIE_GIEL_POSITION                         0x6
#define _INTCON1_PEIE_GIEL_SIZE                             0x1
#define _INTCON1_PEIE_GIEL_LENGTH                           0x1
#define _INTCON1_PEIE_GIEL_MASK                             0x40
#define _INTCON1_GIE_GIEH_POSN                              0x7
#define _INTCON1_GIE_GIEH_POSITION                          0x7
#define _INTCON1_GIE_GIEH_SIZE                              0x1
#define _INTCON1_GIE_GIEH_LENGTH                            0x1
#define _INTCON1_GIE_GIEH_MASK                              0x80
#define _INTCON1_INT0F_POSN                                 0x1
#define _INTCON1_INT0F_POSITION                             0x1
#define _INTCON1_INT0F_SIZE                                 0x1
#define _INTCON1_INT0F_LENGTH                               0x1
#define _INTCON1_INT0F_MASK                                 0x2
#define _INTCON1_T0IF_POSN                                  0x2
#define _INTCON1_T0IF_POSITION                              0x2
#define _INTCON1_T0IF_SIZE                                  0x1
#define _INTCON1_T0IF_LENGTH                                0x1
#define _INTCON1_T0IF_MASK                                  0x4
#define _INTCON1_INT0E_POSN                                 0x4
#define _INTCON1_INT0E_POSITION                             0x4
#define _INTCON1_INT0E_SIZE                                 0x1
#define _INTCON1_INT0E_LENGTH                               0x1
#define _INTCON1_INT0E_MASK                                 0x10
#define _INTCON1_T0IE_POSN                                  0x5
#define _INTCON1_T0IE_POSITION                              0x5
#define _INTCON1_T0IE_SIZE                                  0x1
#define _INTCON1_T0IE_LENGTH                                0x1
#define _INTCON1_T0IE_MASK                                  0x20
#define _INTCON1_PEIE_POSN                                  0x6
#define _INTCON1_PEIE_POSITION                              0x6
#define _INTCON1_PEIE_SIZE                                  0x1
#define _INTCON1_PEIE_LENGTH                                0x1
#define _INTCON1_PEIE_MASK                                  0x40
#define _INTCON1_GIE_POSN                                   0x7
#define _INTCON1_GIE_POSITION                               0x7
#define _INTCON1_GIE_SIZE                                   0x1
#define _INTCON1_GIE_LENGTH                                 0x1
#define _INTCON1_GIE_MASK                                   0x80
#define _INTCON1_GIEL_POSN                                  0x6
#define _INTCON1_GIEL_POSITION                              0x6
#define _INTCON1_GIEL_SIZE                                  0x1
#define _INTCON1_GIEL_LENGTH                                0x1
#define _INTCON1_GIEL_MASK                                  0x40
#define _INTCON1_GIEH_POSN                                  0x7
#define _INTCON1_GIEH_POSITION                              0x7
#define _INTCON1_GIEH_SIZE                                  0x1
#define _INTCON1_GIEH_LENGTH                                0x1
#define _INTCON1_GIEH_MASK                                  0x80

// Register: PROD
#define PROD PROD
extern volatile unsigned short          PROD                __at(0xFF3);
#ifndef _LIB_BUILD
asm("PROD equ 0FF3h");
#endif

// Register: PRODL
#define PRODL PRODL
extern volatile unsigned char           PRODL               __at(0xFF3);
#ifndef _LIB_BUILD
asm("PRODL equ 0FF3h");
#endif

// Register: PRODH
#define PRODH PRODH
extern volatile unsigned char           PRODH               __at(0xFF4);
#ifndef _LIB_BUILD
asm("PRODH equ 0FF4h");
#endif

// Register: TABLAT
#define TABLAT TABLAT
extern volatile unsigned char           TABLAT              __at(0xFF5);
#ifndef _LIB_BUILD
asm("TABLAT equ 0FF5h");
#endif

// Register: TBLPTR
#define TBLPTR TBLPTR
#ifndef __CCI__
extern volatile __uint24                TBLPTR              __at(0xFF6);
#endif
#ifndef _LIB_BUILD
asm("TBLPTR equ 0FF6h");
#endif

// Register: TBLPTRL
#define TBLPTRL TBLPTRL
extern volatile unsigned char           TBLPTRL             __at(0xFF6);
#ifndef _LIB_BUILD
asm("TBLPTRL equ 0FF6h");
#endif

// Register: TBLPTRH
#define TBLPTRH TBLPTRH
extern volatile unsigned char           TBLPTRH             __at(0xFF7);
#ifndef _LIB_BUILD
asm("TBLPTRH equ 0FF7h");
#endif

// Register: TBLPTRU
#define TBLPTRU TBLPTRU
extern volatile unsigned char           TBLPTRU             __at(0xFF8);
#ifndef _LIB_BUILD
asm("TBLPTRU equ 0FF8h");
#endif

// Register: PCLAT
#define PCLAT PCLAT
#ifndef __CCI__
extern volatile __uint24                PCLAT               __at(0xFF9);
#endif
#ifndef _LIB_BUILD
asm("PCLAT equ 0FF9h");
#endif
// aliases
#ifndef __CCI__
extern volatile __uint24                PC                  __at(0xFF9);
#endif
#ifndef _LIB_BUILD
asm("PC equ 0FF9h");
#endif

